#include"class_1_10.h"

/************************************************************************************************************************/
/*39. 组合总和1
*递归回溯的方法
*/
/*
vector<vector<int> > Solution::combinationSum(vector<int>& candidates, int target){
    vector<vector<int> > vec;
    int n = candidates.size(),num;
    if(n<=0)return vec;
    for(int i = 0;i<n;i++){
        num = candidates[i];
        if(target - num >=0){
            vector<int> v;
            v.push_back(num);
            sol(vec,candidates,v,target-num,n,i);
        }
    }
    return vec;
}
void Solution::sol(vector<vector<int> >& vec ,vector<int>& candidates,vector<int>& v,int target,int n,int s){
    if(target == 0){
        vec.push_back(v);
        return;
    }
    if(target < 0)return;
    int num;
    for(int i =s;i<n;i++){
        num = candidates[i];
        if(target - num >=0){
            vector<int> vv(v);
            vv.push_back(num);
            sol(vec,candidates,vv,target-num,n,i);
        }
    }
}
*/
/************************************************************************************************************************/
/************************************************************************************************************************/
/************************************************************************************************************************/
/************************************************************************************************************************/
/************************************************************************************************************************/
/************************************************************************************************************************/
